{
 "documents": [
  {
   "name": "Academic Guidance.pdf",
   "summaries": "Many resources are available to help graduate students thrive academically and take charge of their educations.\nFIND OUT MORE IN THE GAP GUIDANCE AND SUPPORT student talking with staff/faculty VPGE staff collaborate closely with students, faculty, and staff to promote graduate students' academic success and personal wellbeing."
  },
  {
   "name": "Advising & Mentoring.pdf",
   "summaries": "Academic advising by Stanford faculty is a critical component of all graduate students’ education.\nPolicies & Best Practices for Advising Relationships at Stanford (PDF) Guidelines for Faculty-Student Advising at Stanford (PDF) Advising vs.\nShared Values, Shared Goals & Shared Responsbilities Shared Values Educational excellence Academic and research integrity Spirit of exploration and collaboration Respect and care for others Professionalism in all aspects of advising relationships Shared Goals Academic progress and graduation of student or appointment completion for postdoctoral scholar Mastery of the subject material Advancement of knowledge and skills Professional development and personal growth Career success and satisfaction Shared Responsibilities Uphold and abide by department, School, and University policies Maintain a respectful and inclusive learning environment Abide by highest professional standards Foster a culture of open and honest communication and collaboration Use Stanford resources appropriately Related Links VPGE Programs \f"
  },
  {
   "name": "Career Development Guides.pdf",
   "summaries": "read more about experimental quality Advancing Careers  Articles from the FOCUS newsletter Advancing Careers is a collection of articles that were published in the Burroughs Wellcome Fund's FOCUS newsletter.\nTopics include:  read more about advancing careers Working with Institutional Review Boards  Protecting the rights and welfare of human subjects If you intend to conduct research involving human subjects, before you can begin, you must obtain the approval of your institution's Institutional Review Board (IRB).\nread more about working with institutional review boards Thriving in an Era of Team Science The fourth installment of the Burroughs Wellcome Fund Career Development Guide series has been released.\nread more about thriving in an era of team science Moving On The latest installment in BWF’s Career Development Guide series is out.\nread more about staffing the lab Communicating Science: Giving Talks  Communicating Science:  Giving Talks is the first in a series career development guides published by the Burroughs Wellcome Fund."
  },
  {
   "name": "Career Resources.pdf",
   "summaries": "Programs include the Professional Development Seminar Series, the Doctoral Career Paths Seminars, Graduate Women's Gatherings, Inter-University Student of Color Dinner/Speaker Series, Summer Professional Development Workshops for Doctoral Students, Mentornet (electronic mentoring program for diversity in science and engineering), GradUate Small project Help (GuSH), and G.S.A. Graduate Student/Provost Conference Funding.\nCareer & Professional Development Center Contact: 412-268-2064 / career@andrew.cmu.edu Location: West Wing - 2nd Floor  The Career & Professional Development Center is staffed with Career Consultants who are assigned to serve students in individual colleges other than the Heinz College and Tepper School of Business (see below).\nCareer Consultants can assist graduate students in writing resumes, vitae and cover letters, preparing for interviews and planning job search strategies for summer, part-time or professional employment.\nThe Versatile PhD Contact: 412-268-2064 / career@andrew.cmu.edu  Versatile PhD is an online resource designed to help humanities, social science and STEM PhDs identify, prepare for, and succeed in non-academic careers.\nCMU graduate students, faculty, alumni and others have free access to premium resources provided through the University's subscription to Versatile PhD.\nThe Virtual PhD is a collaborative resource offered by the Career and Professional Development Center and the Office of the Assistant Vice Provost for Graduate Education  College-Specific Career Service Centers Heinz College Students: Career Services Career Services partners with Heinz College students to develop a personalized career plan and to build effective tools and resources for career search and development.\nThe Versatile PhD is an online resource designed to help humanities, social science and STEM PhDs identify, prepare for, and succeed in non-academic careers."
  },
  {
   "name": "Diversity, Inclusion, and Equity.pdf",
   "summaries": "Programs with Faculty Funding   TIDE Ambassadors (Teaching for Inclusiveness, Diversity, & Equity) Through this year-long fellowship program, faculty explore how they can enhance students’ learning and academic success across cultural, social, and learning differences by adopting a strength-based, inclusive, and equitable approach to teaching and learning grounded in the value of diversity.\nTEFD refers to this approach as \"Mutual Mentoring.\"  More about Mutual Mentoring TEFD Services Kirsten Helmer listening to a colleague  Diversity & Inclusive Teaching Consultation Do you have questions related to issues of inclusive teaching, equity, and diversity?\nExplore consultation topics  Diversity Strategic Planning & Implementation TEFD helps the leadership of colleges/schools and departments across the UMass Amherst campus to understand and discuss their goals and needs with respect to intercultural competency in teaching, and to develop recommendations, strategies, and plans of action with those units to address their teaching challenges and reach their goals for improving intercultural competency and effectiveness.\nMore about Facilitation Possibilities Programs  NEURODIVERSITY UNIVERSITY™2018 Symposium Special Event - NEURODIVERSITY UNIVERSITY™2018 Symposium Date:  Saturday - April 21, 2018Time:  9:30AM - 3:00PM  Detailed schedule see below Location:  Integrative Learning Center  Focusing on the theme of INTERSECTIONALITY AND SPECTRUM IDENTITIES, the 2018 Neurodiversity Symposium will feature an interdisciplinary faculty panel on conceptualizing autism, a keynote talk by best-selling author and advocate John Elder Robison, a Neurodiversity town hall, a film \fscreening, and multiple workshops and resource-sharing opportunities for educators, students, parents, and members of the community.\nThe 2018 Symposium is co-sponsored by the Department of Communication, the Department of Psychological and Brain Sciences (Developmental Disabilities and Human Services Program), Boltwood Project: Civic Engagement and Service Learning, Institute for Teaching Excellence and Faculty Development (TEFD), the College of Education (Center for Student Success Research), and Five College Blended Learning.\nWebsite:  http://www.johnrobison.com  Schedule  10:00AM – 11:30AM Keynote Talk and Q & A: John Elder Robison – Location: Integrative Learning Center ILC N151  12:30PM – 1:30PM Breakout Sessions: Spectrum Identities, Student Success Panel, Expressive Arts Therapies – various room in the Integrative Learning Center  2:00PM – 3:00PM Town Hall Forum in N151 ILC (includes opportunity for sharing resources)  Of special interest to faculty: Panel “Succeeding in Higher Education – Stories from Neurodiverse Students”  During this session four neurodiverse-identifying students will share their stories of challenges and successes as students at UMass Amherst.\nMore about the forum  Question from the audience in difficult conversations panel discussion  Diversity Lunch Talks Come for lunch (provided by TEFD) and connect with and join your colleagues to explore issues related to diversity, inclusiveness, and equity in teaching.\nMore about this lunch series  engaged crowd at a diversity teaching workshop  Diversity Teaching Workshops TEFD offers evidence-based workshops on a wide variety of topics that are open to all faculty, post-docs, and graduate students.\nMore about diversity teaching workshops   Winter Institute for Intercultural Communication In partnership with The International Communication Institute, TEFD co-hosts four days of workshops at the UMass Center at Springfield where you will engage on current topics in intercultural communication, putting theory into practice."
  },
  {
   "name": "Faculty Mentoring Program Resources.pdf",
   "summaries": "sources UCSF Faculty Mentoring Program Toolkit Mentoring Curriculum  Mentor Consultation Service Request Consultation  Meeting Tools  First Meeting Checklist Structuring Meeting Time Tips for Enhancing Mentoring Relationships  The One-Minute Mentor Forms  Individual Development Plan (IDP) — PDF Individual Development Plan (IDP) — Word document Mentoring Partnership Agreement Mentor's Meeting Journal Academy of Medical Educators IDP Related Readings  Feldman Papers on Mentoring  Selected Articles on Mentoring  Web links  Institute for Clinical Research Education:  Mentoring Resources The Academic Senate The Academy of Medical Educators The Chancellor's Advisory Committee on the Status of Women Clinical and Translational Sciences Institute Training (CTSI) Mentor Development Program (CTSI) UCSF Educational Skills Workshops UCSF Profiles   logo  \f"
  },
  {
   "name": "Faculty Mentoring Program.pdf",
   "summaries": "Faculty Mentoring Program Expand All Introduction This mentoring program is intended to be a useful way of helping new faculty members adjust to their new environment.\nWhether it is academe itself that is new, or simply the UC San Diego campus, assistance from a well-respected mentor can be an invaluable supplement to the guidance and assistance that a Department Chair provides during the early years at a new university.\nThe program’s success will depend on the new faculty members, their mentors and their department chairs all taking an active role in the acclimation process.\nFor faculty appointed as Associate Professor or Professor, assignment of a mentor is less critical, but highly encouraged, to serve as a means of acclimating the new faculty member to UC San Diego.\nThe Responsibility of the Mentor The mentor should contact the new faculty member in advance of his/her arrival at the University and then meet with the new faculty member on a regular basis over at least the first two years.\nThe mentor should provide informal advice to the new faculty member on aspects of teaching, research and committee work or be able to direct the new faculty member to appropriate other individuals.\nThere is no evaluation or assessment of the new faculty member on the part of the mentor, only supportive guidance and constructive feedback.\nThe Responsibility of the New Faculty Member The new faculty member should keep his/her mentor informed of any problems or concerns as they arise.\nWhen input is desired, new faculty should leave sufficient time in the grant proposal and paper submission process to allow his/her mentor the opportunity to review and critique drafts.\nThe Mentor The most important tasks of a good mentor are to help the new faculty member achieve excellence and to acclimate to UC San Diego.\nA good relationship with a supportive, active mentor has been shown to contribute significantly to a new faculty member’s career development and satisfaction.\nQualities of a Good Mentor Accessibility – the mentor is encouraged to make time to be available to the new faculty member.\nNetworking – the mentor should be able to help the new faculty member establish a professional network.\nIndependence – the new faculty member’s intellectual independence from the mentor must be carefully preserved and the mentor must avoid developing a competitive relationship with the new faculty member.\nBenefits for the mentor Satisfaction in assisting in the development of a colleague Ideas for and feedback about the mentor’s own teaching / scholarship A network of colleagues who have passed through the program Retention of excellent faculty colleagues Enhancement of department quality Changing Mentors In cases of changing commitments, incompatibility, or where the relationship is not mutually fulfilling, either the new faculty member or mentor should seek confidential advice from his/her Chair.\nThe new faculty member, in any case, should be encouraged to seek out additional mentors as the need arises."
  },
  {
   "name": "Faculty Mentoring Program2.pdf",
   "summaries": "Responding to the results from the Faculty Climate Survey, the UCSF Faculty Mentoring Program was established in 2006 with the goals of supporting the recruitment and retention of the highest quality faculty, increasing faculty diversity through improved mentoring of under-represented faculty and improving faculty career satisfaction and success.\nRead below for more information, or contact Irené Merry, Mentoring Program Coordinator, at Irene.Merry@ucsf.edu.\nread more  The Lifetime Achievement in Mentoring Award recognizes faculty mentors at UCSF who have demonstrated a commitment to mentoring in the academic health sciences.\nread more   A showcase of the impact UCSF faculty mentors and mentees have had on the lives of UCSF faculty.\nSIX WORDS ABOUT YOUR MENTOR  \f If you have questions about the UCSF Faculty Mentoring Program, contact Irenee Merry, Mentoring Program Coordinator, at Irene.Merry@ucsf.edu."
  },
  {
   "name": "Faculty Mentoring Toolkit.pdf",
   "summaries": "Feldman, MD, MPhil, UCSF Faculty Mentoring Program Purpose The purpose of the Faculty Mentoring Tool Kit is to: erview of the UCSF Faculty Mentori Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, FACP Professor of Medicine Chief, Division of General Internal Medicine Associate Vice Provost, Faculty Mentoring University of California, San Francisco 1545 Divisadero, Suite 316 San Francisco, CA 94143-0320 \fmitchell.feldman@ucsf.edu Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mission and Vision Mission All UCSF faculty members feel supported in their pursuit of a satisfying and successful career.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Faculty Mentoring Program Goals  provide all junior faculty mentees with a career mentor  mentor/mentee pairs  mentor/mentee competencies at UCSF ase of processes and outcomes to support and evaluate mentoring activities  support faculty mentoring at UCSF Program Core Components Mentoring Program Coordinator Establish and oversee program for faculty at UCSF  Responsible for setting up and overseeing mentoring program in Dept/ORU/Division -on-One mentoring program All junior/new faculty members in the four professional Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nAttributes and skills • Associate or higher rank • Dedicated time (0.10 FTE per 10-15 mentor/mentee pairs) • Outstanding communication skills • Knowledge/experience with all aspects of advancement and promotion at UCSF Responsibilities • Overall responsibility for faculty mentoring in their department or division • Set up mentee/mentor pairs (main target mentees are junior faculty up to associate rank; new faculty who have been at UCSF for 3 years or less should also be offered a mentor) • Establish local system for documenting and tracking these pairs • Responsible for oversight of mentoring program—including yearly review of pairs • Provide guidance and support for reassignment of mentees as needed • Work with the UCSF Associate Vice Provost, Faculty Mentoring, to: \fo Conduct qualitative and quantitative evaluation of the program o Disseminate findings and recommendations o Attend mentoring workshops and organize mentoring events for their faculty o Attend yearly mentoring facilitator meetings Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mentoring Facilitator Lists All mentoring facilitator lists can be found online at: http://academicaffairs.ucsf.edu/ccfl/faculty_mentoring_program_guidelines.php School of Dentistry http://academicaffairs.ucsf.edu/ccfl/media/SOD_Mentoring_Facilitators.pdf School of Medicine http://academicaffairs.ucsf.edu/ccfl/media/SOM_%20Mentoring_Facilitators.pdf School of Pharmacy http://academicaffairs.ucsf.edu/ccfl/media/SOP_%20Mentoring_Facilitators.pdf School of Nursing http://academicaffairs.ucsf.edu/ccfl/media/SON_Mentoring_Facilitators.pdf Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program What is Mentoring?\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mentor Roles and Functions Role Responsibility Relationship with Individual Manager Direct the work of the individual • Focused on performance, professional development and career development • Based on organizational needs • Driven by learning agenda influenced by organizational needs • Inside the hierarchy of direct reporting relationships • Sometimes, but not always confidential \fSponsor Champion the individual • Focused on career development and advancement • Driven by advancement goals rather than a learning agenda • Inside or outside the hierarchy of direct reporting relationships • Sometimes, but not always, confidential Mentor Guide and support the individual • Focused on professional and personal development • Based on mentee’s expressed needs • Driven by specific learning agenda identified by the mentee • May be outside the hierarchy of direct reporting relationships • Confidential Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mentoring Functions Career Functions “Those aspects of a relationship that enhance advancement in the organization.”  Psychosocial Functions “Those aspects of a relationship that enhance an individual’s sense of competence, identity and effectiveness.”  (Kram, 1983) Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Why Mentoring Matters Mentoring has been shown to:   academic health careers  linked to funding and publications)    development  activities -family conflict Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Benefits of Mentoring Benefits for Mentees Having a mentor and receiving more mentoring functions is associated with more favorable objective (compensation, promotion) and subjective (career/job satisfaction) outcomes \fBenefits for Mentors Include developing a personal support network, information and feedback from protégés, satisfaction from helping others, recognition (including accelerated promotion), and improved career satisfaction Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Benefits of Mentoring Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program UCSF Faculty Mentoring Program Yearly Timeline We suggest that the mentor and mentee commit to meeting for the next twelve months.\nJuly - August ____ Mentor/Mentee matching and orientation January - February ____ Mid year meeting June - July ____ End of year meeting: discuss continuing mentoring relationship or matching with new mentor Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mentoring Facilitator Checklist Finalize list of eligible mentees’ (junior/new faculty) current mentoring needs and relationships Assemble list of eligible mentors – Limit 2-3 ‘career’ mentees per mentor Assist in mentor/mentee pairings, confirm existing pairs and make assignments as needed Create database of mentor-mentee pairs Distribute mentoring contract, IDP, meeting guide and other materials Periodic check-in: meet with mentors/mentees as needed Organize faculty development mentoring activities: faculty meetings, grand rounds, retreats Annual meeting or survey of mentors and mentees Assist in program evaluation Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Characteristics of an Effective Mentor: The Three C’s Competence Professional knowledge and experience Respect Interpersonal skills and good judgment Confidence Shares network of contacts and resources Allows protégé to develop his/her own terms Demonstrates initiative, takes risks Shares credit Commitment Invests time, energy and effort to mentoring Shares personal experience Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program \fSelecting Mentors In matching mentors and mentees consider the following:  eligible to be mentors ‘career’ mentees  match are more satisfied with their mentors  • Career interests • Gender (gender matching has been shown to be helpful for female mentees) • Race/ethnicity • Age • Personal chemistry (important but hard to predict) Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mentoring Partnership Agreement As a mentor and mentee in the UCSF Faculty Mentoring Program, we agree to abide by the following set of guidelines: 1.\n5. Other: __________________________________________________ __________________________________________________ __________________________________________________ ___________________________ _______________________ Mentor Mentee ______________________ Date Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Individual Development Plan (IDP) UCSF Faculty Mentoring Program Instructions to Mentees: Please complete this form yearly and give a copy to your mentor before your mentoring session.\nDate: Mentee Name: Mentor Name: Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Time Allocation as Estimated by Mentee: ___ % Teaching/Training/Providing Mentoring ___ % Research ___ % Patient Care ___ % Administration/Other Services How (if at all) would you like to change this time distribution?\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Current Professional Responsibilities List your major professional responsibilities and if you anticipate significant changes in the coming year: 1.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Future Professional Goals Short Term Goals List your professional goals for the coming year.\nGoal: Expected outcome: Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mentoring Meeting Journal Use this page to record the discussion points in each of your mentoring meetings.\nDate: Check-In (e.g. urgent issues, work-life balance, personal issues): Goal Discussion: Action Items: Next meeting date: ______________________ \fCopyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Phases of the Mentoring Relationship Initiation phase (6-12 months) ired and respected for competence and ability to provide support and guidance  assistance and can transmit mentors values Cultivation phase (2-5 yrs) t reality  the interpersonal bond strengthens Separation phase ’s life at work; feelings of loss, anxiety ration  independently and for mentor to demonstrate that one has been successful in developing new talent Redefinition phase  alence, discomfort (Kram 1983) Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Initiation: First Meeting Checklist Get to Know Each Other Share information about your professional and personal life Learn something new about your mentee/mentor Establish Guidelines When and where will we meet?\nPartnership Agreement Review partnership agreement, modify if desired, sign and exchange Review goals for the mentoring relationship Confirm Next Steps Schedule date, time and place of future meetings Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Initiation: Structuring Meeting Time Determine how to use your time together.\nFor a meeting of about 1½ hours split the time roughly as follows: First 10 Minutes Engage in personal/professional “check-in” \fNext 20 Minutes Focus on ‘front burner’ issues (upcoming presentation, manuscript revision, etc.) Next 60 Minutes Discuss current and long term goals and priorities Summarize discussion, clarify tasks, schedule follow-up meeting Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Initiation: Expectations A critical component of a successful mentoring relationship is clarity of commitment and expectations.\nMentors and mentees need to agree on:    ality “Off-limits” conversations   Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Cultivating the Relationship: Building Trust When people trust each other, they allow their most authentic self to emerge.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Cultivating the Relationship: Giving (and Receiving) Feedback Mentees want to receive honest, candid feedback from their mentor.\nEffective feedback:    \f Effective Feedback from Mentee:  offered was beneficial and solved an issue  positive mentoring experience  to a positive mentoring experience Effective Feedback to Mentee:     Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Being a Pro-Active Mentee The most successful mentoring partnerships are those in which the mentee takes the initiative and truly drives the partnership.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mentee Strategies to Achieve Mentoring Objectives Whether your objectives focus on broad issues or more specific developmental areas, your mentor’s ability to help you attain those objectives will be enhanced when you have clearly defined where you want to go and how you want to get there.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mentee Dos and Don’ts Do • Take initiative • Look for opportunities to teach your mentor • Be respectful of mentor’s time • Communicate agenda and goals with mentor prior to meeting • Clarify goals and expectations • Practice self reflection • Support your peers • Keep your CV, IDP, etc.\nup to date • Have multiple mentors \f• Clarify your values Don’t • Be passive—don’t wait for the mentor to initiate interactions • Be late, disorganized • Stay in the comfort zone • Stay in a mentoring relationship when it is no longer helpful Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Choosing a Mentor Choose a mentor who has the following qualities: • Interested in developing your career • Commitment to mentoring • Match your emotional needs o Do you need more support and praise or more challenge?\no Research/scholarly/clinical interests • A successful track record • Good communication skills • Will provide networking opportunities • Is institutionally savvy • Expresses interest in you as a person • There is potential for reciprocity Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mentors Role in Mentee Development Support • Listening—actively (empathically) • Expressing positive expectations (Mentors) balance both a present sense of where their students are and a dream of what they can become.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Evaluating Your Mentee’s Goals Use the checklist below to appraise your mentee’s goals: Specificity Has your mentee identified specific short and long term goals?\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mentor Dos and Don’ts Do • Listen actively • Support and facilitate networking and brokering • Teach by example • Be aware of role conflict • Encourage and motivate mentee to move beyond their comfort zone • Promote independence • Promote balance • Rejoice in success and convey your joy • Encourage reciprocity Don’t • Fix the problem • Take credit • Take over • Threaten, coerce or use undue influence • Lose critical oversight— allow friendship to cloud judgment • Condemn (mistakes or lack of agreement are not career altering disasters) Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mentor’s Meeting Checklist  n and review mentee’s CV and IDP prior to meeting  arrangements --and what you expect from mentee ’s short/long term goals  accurate, up-to-date information on advancement and promotion policies for your mentee’s series and rank (see the Academic Senate Faculty Handbook at http://senate.ucsf.edu/facultyhandbook/index.html) ing, \fcurriculum development etc.\nthat is consistent with their career goals  supervisor and mentor for the mentee  organizations helpful for career development  UCSF Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Negative Mentoring Experiences Dyad Mismatch Values Work style Personality Lack of mentor expertise Interpersonal and/or technical incompetence General Dysfunctionality Bad attitude Personal problems Distancing Behavior Neglect (most common negative behavior) Manipulative Behavior Inappropriate delegation Credit taking Mentor Role Conflicts Role demands of a direct supervisor may conflict with the role demands of a mentor (Eby 2000) Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Consequences of Negative Mentoring Relationships For Mentees Higher levels of work stress, lower self esteem More likely to leave For Mentors Less likely to mentor others Less likely to invest in other work activities For Organizations Culture of mistrust and lack of voluntarism Copyright © 2017 The Regents of the University of California, All Rights Reserved \fCreated by Mitchell D.\nMentor Consultation Service http://accelerate.ucsf.edu/research/mc-consult Office of Career and Professional Development http://www.career.ucsf.edu/ SOM Key Educational Skills Series http://www.medschool.ucsf.edu/workshops/ Training in Clinical Research http://www.epibiostat.ucsf.edu/courses/RoadmapK12.html UCSF Academic Affairs http://academicaffairs.ucsf.edu/ UCSF Graduate Student Mentoring Program http://graduate.ucsf.edu/content/uc-leads UCSF Postdoc Mentoring Program http://graduate.ucsf.edu/postdoctoral/getting-mentoring-you-need UCSF Preparing Future Faculty http://career.ucsf.edu/pff/ Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D.\nFeldman, MD, MPhil, UCSF Faculty Mentoring Program Mentoring Resources Partial Listing of Mentoring Programs at Health Sciences Universities: Updated 1/9/13 Johns Hopkins School of Public Heath, Center for Mind-Body Research http://www.jhsph.edu/mindbodyresearch/mentoring_program/ Medical College of Virginia Campus Office of Faculty and Instructional Development, School of Medicine http://www.medschool.vcu.edu/facultyaffairs/career_dev/mentoring.html Northeastern Ohio Universities, College of Medicine and College of Pharmacy http://www.neomed.edu/facultystaff/facultydevelopment/masterteachersguild Penn State University College of Medicine http://www.pennstatehershey.org/web/opd/home/programs/mentoring Robert Wood Johnson Medical School, University & Dentistry of New Jersey http://rwjms.umdnj.edu/faculty/faculty_development/mentoring.html University of Arkansas Medical Sciences College of Medicine http://www.uams.edu/facultyaffairs/mentoring_resources.asp University of California, Davis http://www.ucdmc.ucdavis.edu/facultydev/mentoring.html University of California San Diego, National Center of Leadership in Academic Medicine http://nclam.ucsd.edu/ \fUniversity of California San Diego Academic Affairs http://academicaffairs.ucsd.edu/faculty/programs/faculty-mentoring-program.html University of Madison Wisconsin http://acstaff.wisc.edu/mentoring-program.htm University of Miami School of Medicine, Office of Research Education and Training http://uresearch.miami.edu/ University of Massachusetts Medical School http://www.umassmed.edu/Macy/index.aspx?linkidentifier=id&itemid=7722 The University of North Carolina at Chapel Hill, School of Pharmacy http://www.pharmacy.unc.edu/faculty/bill-and-karen-campbell-faculty-mentoring-program University of Pennsylvania School of Medicine http://www.med.upenn.edu/mentee/index.shtml University of Pittsburg http://www.icre.pitt.edu/mentoring/ Virginia Commonwealth University School of Medicine http://www.medschool.vcu.edu/facultyaffairs/career_dev/mentoring.html Copyright © 2017 The Regents of the University of California, All Rights Reserved Created by Mitchell D."
  },
  {
   "name": "Faculty Responsibilities in Mentoring Relationships.pdf",
   "summaries": "Faculty Responsibilities in Mentoring Relationships Upon appointment, each junior faculty member should be assigned a more senior member of the faculty as mentor.\nAdditionally, department chairs, deans or their delegates should confer annually with each junior faculty member to provide counseling, i.e., feedback on his/her performance relative to the standards for reappointment or promotion.\nSchools and departments are expected to have policies and practices for providing mentoring to all junior faculty.\nGuidelines Department chairs or deans or their delegates should confer annually with each junior faculty member to provide counseling, i.e., feedback on his/her performance relative to the standards for reappointment or promotion.\nIt is recommended mentors who are senior faculty members be other than the junior faculty's department chairs.\nIn situations in which the initial mentor assignment is not successful, department chairs or deans should work with the junior faculty member to identify a suitable mentor.\nMentors should provide guidance on an ongoing basis and should meet at least annually with their junior faculty mentees.\nJunior faculty should also be encouraged to seek informal mentors from inside or outside their departments who may share interests and provide additional perspectives.\nStanford provides a number of resources specifically aimed at assisting new and junior faculty.\nRead More Additional information about counseling and mentoring are: Counseling  Mentoring  Resources Faculty Mentoring Programs at the Schools School of Earth Sciences Faculty Mentoring Program Pediatric Mentoring Program, School of Medicine Faculty Mentoring Programs outside of Stanford Career Development Award Toolkit--  This virtual resource center through the Palo Alto VA provides helpful information on fostering great mentorship.\nNational Center for Faculty Development and Diversity-- Stanford faculty have access to the mentor network of alums of the NCFDD's Faculty Success Program and other resources.\nFREE copy for new faculty through VPFDD.\nAdvice for New Faculty Members."
  },
  {
   "name": "For Graduate Students & Postdoctoral Scholars.pdf",
   "summaries": "CRLT offers programs and services designed to support graduate students and postdocs in all stages of their teaching careers from training for their first teaching experiences through preparation for the academic job market.\nCampus-wide GSI Teaching Orientation Engineering Orientation ELI/CRLT Courses GSI Guidebook GSI Guidebook for Teaching Labs Certificate programs: U-M Graduate Teacher Certificate (GTC) GTC+, certificate in teaching with digital media, co-sponsored by the Institute for the Humanities Web Resources for GSIs Seminars for Graduate Students and Postdoctoral Scholars CRLT offers a regular schedule of workshops on various topics.\nPanels Certificate programs (graduate students only): U-M Graduate Teacher Certificate (GTC) GTC+, certificate in teaching with digital media, co-sponsored by the Institute for the Humanities Consultations CRLT provides individual, confidential consultations to U-M instructors on a range of topics related to teaching and learning."
  },
  {
   "name": "Funding Opportunities for New and Young Faculty.pdf",
   "summaries": "Find more opportunities by using Pivot and selecting “Individuals: Early Career and Emerging in Field” under “Applicant Type,” or go to the Pivot search results for “New Faculty/New Investigator.”  Federal Agencies Department of Agriculture Program Deadline Program Synopsis Agriculture and Food Research Initiative (AFRI), National Institute of Food and Agriculture varies by program area The Food and Agricultural Science Enhancement (FASE) Grants component includes funding for new investigators.\nDepartment of Defense Program Deadline Program Synopsis Young Investigator Program, Office of Naval Research September ONR’s YIP seeks to identify and support academic scientists and engineers who are in their first or second full-time tenure-track or tenure-track-equivalent academic appointment and who show exceptional promise for doing creative research.\nYoung Investigator Program, Air Force Office of Scientific Research summer The Air Force YIP supports scientists and engineers who have received Ph.D. or equivalent degrees in the last five years and show exceptional ability and promise for conducting basic research.\nThe objective of this program is to foster creative basic research in science and engineering; enhance early career development of outstanding young investigators; and increase opportunities for the young investigator to recognize the Air Force mission and related challenges in science and engineering.\nYIP awards are up to $120,000 per year for three years Department of Energy Program Deadline Program Synopsis \fEarly Career Research Program, Office of Science January for required preapplication, April for application This program supports the development of individual research programs of outstanding scientists early in their careers and stimulates research careers in the disciplines supported by the DOE Office of Science: Advanced Scientific Computing Research; Biological and Environmental Research; Basic Energy Sciences, Fusion Energy Sciences; High Energy Physics, and Nuclear Physics.\nNational Aeronautics and Space Administration Program Deadline Program Synopsis New (Early Career) Investigator Program in Earth Science (ROSES program element), NASA varies; applications are solicited every two years The NIP in Earth Science is designed to support outstanding scientific research and career development of scientists and engineers at the early stage of their professional careers.\nNew Early Career Fellowship Program varies The Early Career Fellowship (ECF) program supports the development of individual research programs of outstanding scientists early in their careers and stimulate s research careers in the areas supported by the Planetary Sciences Division.\nNational Institutes of Health Resource Synopsis Early Stage and Early Established Investigator Policies, Next Generation Researchers Initiative, NIH The NIH Early Stage and Early Established Investigator Policies page includes: Policy Summary Background Determination of Investigator Status Extension of ESI or EEI Status Special Programs NIH Director’s New Innovator Award (DP2) NIH Director’s Early Independence award (DP5) Research Training and Career Development Resources for early career researchers include: Early Research Career Development Research Career Development Awards National Science Foundation \fProgram Deadline Program Synopsis Faculty Early Career Development (CAREER) Program, NSF July CAREER supports early-career faculty who have the potential to serve as academic role models in research and education and to lead advances in the mission of their department or organization.\nComputer and Information Science and Engineering (CISE) Research Initiation Initiative (CRII) August It is expected that funds will be used to support untenured faculty or research scientists (or equivalent) in their first three years in a primary academic position after the PhD, but not more than a total of five years after completion of their PhD.\nNonfederal Agencies Program Deadline Program Synopsis Young Investigator Grants, Alex’s Lemonade Stand Foundation December Grants are designed to support scientists during their fellowship training or early in their research careers.\nIndependent investigators in the first six years of an independent research career or faculty appointment are eligible.\nPetroleum Research Fund Doctoral New Investigator Grants, American Chemical Society October Awards of $110,000 over two years provide start-up funding for scientists and engineers in the United States who are within the first three years of their first academic appointment at the level of Assistant Professor or the equivalent.\nCore Program: Junior Faculty Development, American Diabetes Association April Awards support early investigators as they establish independence as diabetes researchers.\nGrants for Junior Faculty, New Investigator Awards in Alzheimer’s Disease, American Federation for Aging Research varies Glenn Foundation for Medical Research and AFAR Grants for Junior Faculty provide up to $100,000 for a one- to two-year award to junior faculty.\nYoung Investigator Innovation Grants, American Foundation for Suicide Prevention November 15 Grants of up to $85,000 over two years are awarded to investigators at or below the level of assistant professor, with an additional $10,000 ($5,000 per year) for an established suicide researcher who will mentor the Young Investigator.\nCareer Development Award, American Heart Association December Supports healthcare and academic professionals, in the early years of their first professional appointment, to explore innovative questions or pilot studies that will provide preliminary data and training necessary to assure future success as a research scientist in the field of cardiovascular and stroke research.\nResearch Awards, American Society for Mass Spectrometry November 30 The program is open to academic scientists within four years of joining the tenure track faculty or equivalent.\nEarly Career Investigator Award, Bayer Hemophilia Awards Program November for letter of intent This award will fund salary support and research funds for a junior faculty member who wishes to undertake a mentored basic and/or clinical research project in the bleeding disorders field.\nBeckman Young Investigators Program, Arnold and Mabel Beckman Foundation August for letter of intent The program provides research support to young faculty members in the early stages of academic careers in the chemical and life sciences particularly to foster the invention of methods, instruments and materials that will open up new avenues of research in science.\nNARSAD Young Investigator Grants, Brain and Behavior Research Foundation March The program offers up to $35,000 per year for two years to enable promising investigators to either extend their research fellowship training or to begin careers as independent research faculty.\nYoung Investigator Grant for Probiotics Research, Global Probiotics Council February Young investigators who are senior fellows with a committed faculty appointment or early faculty members within a maximum of 5 consecutive years of his/her first faculty appointment (appointments must be in the U.S.) are eligible.\nGreenwall Faculty Scholars Program in Bioethics, Greenwall Foundation September for limited submission application (approximate) The program is a career development award to enable junior faculty members to carry out innovative bioethics research.\nRosenblith New Investigator Award, Health Effects Institute February for letter of intent The award provides up to three years of funding to a new investigator at the assistant professor or equivalent level for a small research project on the health effects of air pollution.\nYoung Investigators’ Research Grants, Human Frontier Science Program March for letter of intent Grants are awarded to teams of researchers from different countries, all of whom are within the first five years after obtaining an independent laboratory.\nIDSA Education and Research Foundation Young Investigator Award, Infectious Diseases Society of America November Candidates for Young Investigator Awards must have a medical or equivalent doctoral level degree, and should have completed an accredited infectious diseases fellowship within the last four years.\nCareer Development Awards, Juvenile Diabetes Research Foundation June Researchers who have received their first faculty-level appointment less than three years before the submission date are eligible to apply for this award.\nKlingenstein-Simons Fellowship Awards in the Neurosciences February The Award supports young investigators in the early stages of their careers engaged in basic or clinical research that may lead to a better understanding of neurological and psychiatric disorders.\nHollis Brownstein Research Grants Program, Leukemia Research Foundation February for letter of intent The Foundation provides one year grants of $100,000 to selected New Investigator researchers to allow innovative scientists to act on their ideas and try new procedures and experiments that will hopefully lead to significant breakthroughs.\nYoung Investigator Grants, Lymphoma Research Foundation September Young Investigator Grants attract and train early career scientists for lymphoma research through three programs: Postdoctoral Fellowships, Clinical Investigator Career Development Awards, and the Lymphoma Clinical Research Mentoring Program.\nRequest For Proposals: Young Investigator Awards, Melanoma Research Alliance varies Applicants must be within four years of their first independent, full time academic faculty appointment at the time of application at the level of Assistant Professor (or equivalent position).\nYoung Investigator Awards, National Ataxia Foundation August for letter of intent One-year grants of $35,000 encourage young investigators to pursue a career in the field of any form of Ataxia research.\nHarry Weaver Neuroscience Scholar Awards, National Multiple Sclerosis Society August The awards support candidates who have concluded their research training and begun academic careers as independent investigators in an area related to multiple sclerosis.\nNeilsen Foundation May for letter of intent Two-year Pilot Research Grants help to establish new investigators in the field of spinal cord injury research and support studies by established investigators who are undertaking new directions in their work.\nCandidates must be eligible to serve as principal investigators engaged in research in the natural and physical sciences or engineering and must be within the first three years of their faculty careers.\nPew Biomedical Scholars May for limited submission application (approximate) The program makes grants to selected academic institutions to support the independent biomedical research of outstanding individuals who are in their first few years of their appointment at the assistant professor level.\nI.M. Rosenzweig Junior Investigator Awards, Pulmonary Fibrosis Foundation November Awards support projects that offer a high likelihood of improving the understanding of pulmonary fibrosis in the following areas: basic science, translational research, clinical medicine/research, and social science/quality of life.\nNew Investigator Grant, Scleroderma Foundation September The Foundation seeks applications from promising new investigators who hold faculty or equivalent positions and who wish to pursue a career in research related to scleroderma.\nNew Investigator Grant, Scoliosis Research Society April 1 and October 1 New investigator research grants are meant to stimulate young members into a career of investigation in spinal deformity and are open to SRS Candidate Fellows or investigators within the first five years of completing their training.\nSearle Scholars Program June for campus limited submission application (approximate) The program makes grants to selected academic institutions to support independent research of outstanding early-career scientists who have recently been appointed as assistant professors on a tenure-track appointment and will be pursuing independent research careers in biochemistry, cell biology, genetics, immunology, neuroscience, pharmacology, and related areas in chemistry, medicine, and the biological sciences.\nDistinguished Scientist Award, Sontag Foundation March The award provides career and research support to early career scientists who demonstrate outstanding promise for making scientific and medical breakthroughs in the field of brain cancer research.\nInnovative, Developmental, and Exploratory Awards, UC California Breast Cancer Research Program October for letter of intent, March for application Researchers at a career level beyond postdoctoral training and \fless than three years as an independent investigator, or entering research from another field, are encouraged to apply for IDEA grants.\nNew Investigator Award, UC Tobacco-Related Disease Research Program varies This award supports new investigators in an independent research program in their research career in the focus areas covered under TRDRP research priorities."
  },
  {
   "name": "Graduate Women's Gatherings.pdf",
   "summaries": "The Graduate Women’s Gatherings are opportunities to meet that focus on issues of particular concern to graduate women.\nThe Graduate Women’s Gatherings are opportunities for women of the graduate student, post-doctoral fellows, faculty and administrator communities to network, share ideas and experiences, gather resources."
  },
  {
   "name": "Helping Students: A Peer Mentoring Approach.pdf",
   "summaries": "Establishing a peer mentoring program in your department can provide several benefits for new and advanced students.\nIn the fall of 2008, she started a peer mentoring program for cognition, learning and development (CLD) graduate students in Educational Psychology.\nFor Zumbrunn, the first step to creating the CLD peer mentoring program was meeting with a focus group of students to better understand their needs.\nSecond, the program offers advanced graduate students an opportunity to mentor students.\nThis valuable experience likely proves beneficial, as many of our graduates continue their careers in academia.” Despite some of the challenges that come from starting a new program, Zumbrunn and Marxhausen are excited about the future of the CLD peer mentoring program.\nMarxhausen plans to become a mentor when she is ready for the task, and Zumbrunn believes that the student-led aspect of this program is an important component in “keeping students interested and passionate about carrying the mentoring torch.”  \fIf you are interested in starting a peer mentoring program in your department, please contact Dr. Laurie Bellows at lbellows1@unl.edu for more information."
  },
  {
   "name": "Making the Right Moves.pdf",
   "summaries": "Making the Right Moves: A Practical Guide to Scientific Management for Postdocs and New Faculty, Second Edition Based on workshops co-sponsored by the Burroughs Wellcome Fund and HHMI, this book is a collection of practical advice and experiences from seasoned biomedical investigators and includes chapters on laboratory leadership, getting funded, project management, and teaching and course design.\n77-96) Getting Started Recruiting Applicants Screening Applicants Interviewing Applicants Evaluating Applicants Making the Offer Asking Staff to Leave \fResources Appendix: Telephone Interview Outline Chapter 5: Mentoring and Being Mentored (pp.\nA Mentor's Responsibilities Strategies for Effective Mentoring in Your Lab Different Mentoring Needs Mentoring Individuals Outside Your Lab How to Get the Mentoring You Need Gender and Culture Issues Resources Chapter 6: Time Management (pp.\n113-124) Strategies for Planning Your Activities Managing Your Time Day to Day Special Issues Resources Chapter 7: Project Management (pp.\nGetting Started Tracking the Work and the Resources Project Management Software Controlling the Project Resources Appendix: Project Management—A Real-life Example Chapter 8: Data Management and Laboratory Notebooks (pp.\n143-152) Day-to-Day Record Keeping: The Laboratory Notebook Tracking and Storing Information Finding the Right Data Management System for You Resources Chapter 9: Getting Funded (pp."
  },
  {
   "name": "Mentoring Program.pdf",
   "summaries": "faculty NEW FACULTY RESOURCES MENTORING PROGRAM Mentoring Program Confidentiality Mentoring, both from senior colleagues and from near peers, is a key to turning these potential roadblocks into areas of advancement (Sorcinelli, 2004).\nResearch shows that having mentors is associated with higher levels of job satisfaction, more effective teaching, stronger records of scholarly productivity, and increased rates of retention, tenure, and promotion (Johnson, 2007; Cartwright, 2008; National Academy, 2010.)  Since 1997, WPI has offered a New Faculty Mentoring Program in order to provide new faculty members with professional and social support.\nElements of WPI’s Program New faculty are asked to complete an information form if they wish to participate in the one-on-one component of the mentoring program.\nThe Morgan Center will recruit an appropriate mentor(s), based on the objectives and preferences expressed by the new faculty member and with input from the individual's department head.\nThe formal mentoring relationship is anticipated to last for the first year of the new faculty member's appointment, but may be extended or terminated at the request of any member of the team.\nWPI's mentoring program also has a strong \"cohort\" component, with regular gatherings of new and early career faculty focused on particular themes or for open discussion.\nAll new faculty are invited to attend, regardless of whether they participate in the one-on-one component of the mentoring program.\nShould I ask for a mentor inside my department or outside?\nIn other departments, it may help to be formally paired with an inside-department mentor through this program.\nCan I have more than one mentor, one inside the department and one outside?\nIn many ways WPI is not a typical university; mentoring helps new faculty get acclimated."
  },
  {
   "name": "Report of the Faculty Mentoring Study.pdf",
   "summaries": "Report of the Faculty Mentoring Study The Provost's Advisory Committee on Mentoring and Community Building Summary of Findings  INTRODUCTION  In November 2000, the Office of the Provost and Executive Vice President for Academic Affairs sponsored a retreat entitled, “Mentoring, Quality of Faculty Life and Community Building.” Nearly 100 University of Michigan administrators attended the retreat, including deans, associate and assistant deans, and department chairs.\nThe committee was charged with the task of identifying strategies to improve support for faculty, improving awareness and understanding of mentoring, and surveying faculty and administrators regarding their experiences with and their needs for mentoring.\nThe purpose of this report is to examine the results of the faculty and administrator surveys and focus groups regarding their experiences with mentoring.\nFINDINGS AND INFERENCES  The findings and inferences outlined below are based on the Committee’s analysis of the data from the surveys of both junior faculty and administrators, each of which was comprised of closed- and open-ended questions about the practices of and support for mentoring on campus.\nWhile both junior faculty and administrators believe mentoring is important, there is no consensus on what constitutes effective mentoring.\nThere is a disjunct between mentoring preferences of faculty and administrators: Junior faculty members prefer structured (formal) mentoring efforts, whereas administrators prefer less structured (informal) approaches.\nAdministrator perceptions According to administrators, mentoring benefits both junior faculty and senior faculty and departments as a whole (e.g., by increasing faculty collaboration and providing an incentive for recruiting).\nJunior faculty perceptions While junior faculty members are satisfied overall with the quality and frequency of the mentoring they receive, they would prefer that senior faculty members and administrators reach out to them more proactively.\nJunior faculty that want more mentoring would prefer that mentoring target their needs, particularly the practicalities of how to accomplish specific professional goals and meet department, discipline-specific and \fUniversity expectations, so that the mentoring “demystifies” the process of becoming a successful and productive faculty member.\nSome junior faculty expressed frustration at receiving outdated, conflicting, or inaccurate advice from their mentors.\nSome find a discrepancy between the message they received as graduate students, to become independent scholars, and the message they receive as junior faculty members, to be mentored.\nSome junior faculty members are comfortable seeking mentoring outside their academic unit, but others who do not seek such mentoring may be at risk.\nStructural issues can influence mentoring Small departments may have too few senior faculty members to mentor junior colleagues.\nWhile these faculty may particularly need mentoring, they may have more difficulty receiving it.\nCommunication and training issues can influence mentoring The desire of junior faculty for increased mentoring may result from a communication problem, caused by units providing inadequate information about mentoring opportunities that are actually available.\nSome senior faculty members may be unprepared to provide good mentoring.\nSome junior faculty groups may have unique mentoring needs above and beyond the needs that typical mentoring addresses.\nUnits should not assume that junior faculty members know what type of mentoring they need.\nUnits should assume junior faculty members need guidance or assistance from the school, college, or department to identify mentors.\nSenior faculty don’t necessarily know what type of mentoring junior faculty need or want.\nThe concept of formal one-on-one mentoring is an impractical approach to meeting junior faculty members’ needs.\nAdministrators perceive more mentoring activities being available (to junior faculty) than do junior faculty.\nFaculty will generally need a combination of mentors from both within and outside the department.\nMentoring efforts can range from formal (e.g., scheduled meetings with the department chair, mentor assignments) to informal (e.g., academic and/or social events that give junior faculty members the chance to meet a variety of senior faculty members in a non-threatening environment).\nMentoring should address the specific needs of individual junior faculty members.\nAn effective approach to mentoring junior faculty is to focus on the process of becoming the best academics they can be, instead of focusing solely on achieving tenure.\n1.1.1 Methods  The Faculty Mentoring Committee decided to conduct two surveys: one to learn about administrators’ perceptions of and experiences with mentoring and one to learn about junior faculty members’ perceptions of and experiences with mentoring.\nThese faculty members hold academic leadership positions in departments that were identified by survey respondents (or were otherwise known) as being actively engaged with faculty mentoring.\nCURRENT STATE OF MENTORING, AS PERCEIVED BY FACULTY AND ADMINISTRATORS   2.1 Information on respondents/participants  Table 1 provides information about the survey respondents, including their positions and, for faculty, key demographics.\n2.2 Current state of mentoring on campus   2.2.1 Types of mentoring activities occurring within units  Tables 2 and 3 summarize faculty and administrator responses about a designated list of mentoring activities.\nTable 2 : Mentoring activities in units, as reported by faculty and administrators   ____________________________________________________________   Junior Faculty  Administrators    N  (% Yes)  N  (% Yes)  image   Dean meets with junior faculty   179   67.0   73   95.9   23.268 ***  Pairing of senior & junior faculty  183  60.1  72  70.8     Orientation for junior faculty  183 \f 52.5  71  57.7     Placing junior faculty on committees  168  42.9  68  77.9  23.918 ***  Peer observation of junior faculty teaching  175  32.6  70  61.4  17.236 ***  Peer network group  180  27.2  68  41.2  4.489 *  Jr. faculty observe senior faculty teaching  179  26.3  69  59.4  23.926 ***  Seminars/workshops  175 \f 24.6  67  50.7  15.301 ***  Junior faculty create development plan  173  17.3  72  31.9  6.396 *  Jr. faculty have a mentoring committee  182  15.4  73  28.8  6.011 *      ____________________________________________________________ Note: * = p < .05, ** = p < .01, *** = p < .001     Table 3 : Mentoring perceived as formal/informal, faculty and administrators   ____________________________________________________________        Junior Faculty  Administrators      N  % formal  \f% informal  N  % formal  % informal  Image                          Dean meets with junior faculty  179  89.4  10.6  73  68.7  31.3  12.065 **  Pairing of senior & junior faculty  183  36.4  63.6  72  58.5  41.5  7.358 **  Orientation for junior faculty  \f183  85.1  14.9  71  65.8  34.2  5.960 *  Placing junior faculty on committees  168  66.2  33.8  68  57.1  42.9     Peer observation of junior faculty teaching  175  37.9  62.1  70  24.4  75.6     Peer network group  180  66.7  33.3  68  15.2  84.8  \f   Jr. faculty observe senior faculty teaching  179  8.9  91.1  69  4.8  95.2     Seminars/workshops  175  100.0  0.0  67  100.0  0.0     Junior faculty create development plan  173  57.1  42.9  72  45.8  54.2     Junior faculty have a mentoring committee  182  36.4  63.6  73  \f40.0  60.0         ____________________________________________________________ Note: * = p < .05, ** = p < .01, *** = p < .001     Administrators and faculty differ in their perceptions of what is formal and what is informal.\nWith the exception of orientation for junior faculty, on each item a markedly higher percentage of administrators perceived more mentoring activities taking place than did junior faculty.\nAdministrator respondents described a variety of additional mentoring activities for junior faculty related to teaching, such as junior and senior faculty co-teaching, release time for junior faculty from teaching, and a variety of other teaching opportunities.\nAdministrators also pointed to professional societies as an important source of mentoring for junior faculty.\nA handful of administrators listed additional activities that they support, such as mentoring junior faculty for administrative posts and helping them prepare for presentations outside the University.\nOne administrator noted that some of their faculty members (with joint academic appointments) also hold appointments in departments that provide formal mentoring.\nOverall, administrators who responded to the open-ended questions believe there are ample mentoring opportunities for junior faculty at the University and beyond.\n2.2.2 Current efforts to assess mentoring in departments/academic programs or schools/colleges  Administrators were asked to review a designated list of assessment data that their departments/academic programs or their schools/colleges might collect on the effectiveness of their faculty mentoring efforts and then to check all that apply.\nTable 4 : Types of assessment data collected on mentoring activities in units, as per administrators   ____________________________________________________________  N=78  Frequency  Percent           Feedback solicited from mentees  27  34.6  Feedback solicited from mentors  22  28.2  Quality and amount of teaching  20  25.6  Participation in and results of reviews  20  25.6  Amount and quality of scholarly work produced  17  21.8  Attendance at relevant training/workshops  11  14.1  Participation on committees  10  12.8  \fTypes of faculty involved (rank, inside/outside department)  8  10.3  Frequency of mentor/mentee contacts  8  10.3  Advantages/disadvantages of mentor-mentee matching  6  7.7  Other  4  5.1  Flexibility of mentoring structure  3  3.8  Effect of incentives on faculty commitment to mentoring  2  2.6   ____________________________________________________________  Units seldom access mentoring activities directly Nearly two-thirds of the administrators indicated that their units do not assess their faculty mentoring efforts.\nTable 5 provides a summary of administrators’ responses to the question, “To which levels of faculty are your faculty mentoring efforts targeted”?\nTable 5 : Groups of faculty to which the academic units target their faculty mentoring (according to administrators)   ____________________________________________________________   Frequency  Percent           Assistant professor  72  92.3  Associate professor  37  47.4  Graduate student instructor  25  32.1  Instructor/lecturer  22  28.2  Research scientist  20  25.6  Professor  16  20.5  Clinical faculty  10 \f 12.8  Other  5  6.4   ____________________________________________________________  Mentoring is largely assumed to target junior faculty.\n2.2.4 Resources directed toward mentoring  Administrators were asked to select the types of resources they direct towards faculty mentoring.\nTable 6 provides the results:  Table 6 : Resources directed toward mentoring (according to administrators)   ____________________________________________________________  (N=78)    Frequency  Percent  Faculty time and effort  70  89.7  Support from staff members  34  43.6  Designated funding  24  30.8  Direct faculty compensation  3  \f3.8  Funds to attend off-campus programs  20  25.6  Other incentives  9  11.5   ____________________________________________________________  Mentoring efforts largely depend on the voluntary commitment of faculty By far, the academic units depend most heavily on faculty members’ time and effort as the key resource for mentoring.\nThe nine open-ended responses identified additional resources that academic units could use to reward faculty for mentoring other faculty, such as funds for mentor/mentee lunches, reduced teaching load, and graduate student support.\n2.3.1 From whom do faculty receive mentoring?\nFaculty survey respondents were provided with a list of types of mentors and asked from which types of mentors they had received mentoring.\nTable 7 : Providers of mentoring for junior faculty, as per administrators  ____________________________________________________________     Total  (% yes)  Men  (% yes)  Women  (% yes)  \fMinority  (% yes)  White  (% yes)  International  (% yes)   n=190  n=110  n=68  N=45  n=106  n=18                       Senior faculty within your department  84.2  87.3  79.4  77.8  84.0  94.4  Faculty from another university  47.4  41.8  58.8 * \f 51.1  48.1  55.6  Faculty outside your department  45.8  46.4  50.0  46.7  51.9  27.8  Junior faculty within your department  34.0  36.4  33.8  37.8  33.0  44.4  Faculty outside your school  20.0  18.2  23.5  26.7  22.6  5.6  Administrators within your department  13.7  13.6  14.7  13.3  13.2 \f 22.2  Units outside your school/CRLT  9.5  8.2  11.8  8.9  10.4  11.1  Have not received any mentoring  5.3  5.5  4.4  4.4  6.6  0.0  Persons outside academia  4.7  2.7  7.4  4.4  2.8  0.0  Other  4.2  4.5  2.9  6.7  2.8  0.0  Administrators outside dept./ University \f 1.1  0.9  1.5  2.2  0.9  0.0  ____________________________________________________________ * p>.05  While most mentoring takes place within the home unit, more women, international and minority faculty seek mentoring from outside the university  Across all faculty groupings, a high percentage of faculty had received mentoring from senior faculty within their units.\nAmong all faculty groupings, international faculty respondents were most likely (94%) to have received mentoring from senior faculty in their departments, whereas women faculty (79%) and minority faculty respondents (78%) were less likely to have received mentoring from senior faculty in their departments.\n2.3.2 Criteria used to select mentors  Administrators were asked to identify (from a list) the criteria that their schools, colleges, departments/programs, or subunits, commonly consider when selecting faculty to serve as mentors .\nTable 8 : Criteria for selecting mentors for junior faculty (according to administrators)  ____________________________________________________________   Frequency  Percent  Similar research interests  59  75.6  Interpersonal compatibility  55  \f70.5  Teaching effectiveness  49  62.8  Academic credentials  39  50.0  Roles/responsibilities in unit  38  48.7  Potential for collaboration on research & teaching  35  44.9  Time availability  28  35.9  Gender  22  28.2  Location/shared facilities  16  20.5  Race/Ethnicity  11  14.1  Other  8  10.3  ____________________________________________________________  Faculty administrators select mentors based largely on professional, rather than on race/ethnicity criteria.\nThe largest percentage of administrators identified similar research interests (76%), interpersonal compatibility (70%), and teaching effectiveness (63%) as the three criteria they use most when selecting faculty mentors.\nVery few administrators (14%) selected race/ethnicity as a criterion their units use to select faculty mentors.\nAdministrators were invited to identity other criteria their units consider and were also asked to explain which criteria for selecting faculty mentors they believe to be very or critically important.\nIn the open-ended responses, administrators cited a long list of qualities that they believe are very or critically important in selecting faculty mentors, foremost among them the interpersonal compatibility of the mentor and mentee.\nAdministrators assigned equal importance to the need for the faculty mentors to share research and scholarly interests with their mentees.\n2.4 Attitudes toward mentoring activities  2.4.1 Frequency of/ Satisfaction with mentoring, as reported by faculty Table 9 below summarizes responses to a question about how often the faculty members have interacted with their mentors, sorted by demographics.\nTable 9 : Frequency of faculty interaction with mentors  ____________________________________________________________  \f   Total  Men  Women  Minority  White  International   n=179  n=105  n=64  n=44  N=98  n=18                       Daily  6.1  8.6  3.1  9.1  7.1  0.0  2-3 times/week  18.4  20.0 \f 15.6  18.2  21.4  16.7  Once/twice-month  29.6  36.2  21.9  25.0  31.6  50.0  Once/twice-semester  26.3  21.9  32.8  29.5  24.5  16.7  Other  19.6  13.3  26.6  18.2  15.3  16.7  ____________________________________________________________  The frequency of mentoring interactions was variable, and was higher among males and whites.\nTable 10 below summarizes responses to a question about how satisfied the faculty respondents were with the mentoring they have received and with how often they have interacted with their mentors.\nTable 10 : Satisfaction with frequency and quality of mentoring contacts  ____________________________________________________________     Frequency of Contact  Quality of Contact   (% responding yes)  (% responding yes)           Total  73.0 (n=174)  80.2 (n=167)  Men  79.2 (n=106)  80.8 (n=104)  Women  64.1 (n=64)  79.3 (n=58)  Minority  83.7 (n=43)  81.4 (n=43)  White  \f70.3 (n=101)  80.2 (n=96)  International  64.7 (n=17)  75.0 (n=16)  ____________________________________________________________  While satisfaction with mentoring was generally high, women, international faculty and minorities were less satisfied with the frequency of interactions, and international faculty were least satisfied overall.\nOpen-Ended Responses     The survey also posed two follow-up (open-ended) questions to faculty respondents:  [If you are not satisfied with how often you interact with your mentor(s)], how much contact would you like to have?\nOn the whole, the faculty respondents’ open-ended responses consistently reflected their need for regular contact with mentors.\n2.4.2 Levels of mentoring support  The surveys presented junior faculty and administrators with a series of common academic tasks that faculty perform.\nFor each task, faculty respondents were asked to indicate what level of mentoring support they would like to receive, whereas administrators were asked to report the level of mentoring and support they believe their units provide to junior faculty.\n174 \f 1.82  0.77  67  2.19  0.56  0.000  Using teaching resources-dept  180  1.77  0.67  62  1.81  0.72     Making contacts-industry  174  1.75  0.76  58  1.55  0.65     Collaborate on teaching- in UM  168  1.73  0.66  63  1.81  0.56    \f ____________________________________________________________ Note: 1=Provide/Desire little or no support, 2=Provide/Desire some support, 3=Provide/Desire high level of support  (a) p values are for t-tests   A disjunction emerged between mentoring offered and mentoring desired Junior faculty and administrators agreed that junior faculty need mentoring and support with becoming integrated into the UM culture, but faculty respondents wanted more mentoring and support than the administrators said their academic units provide.\nAdministrators and junior faculty agree on only a subset of activities as proper topics for mentoring.\nJunior faculty and administrators also agreed that junior faculty need mentoring for preparing performance reports, using departmental teaching resources, and balancing work and family.\nJunior faculty were much more likely than administrators to want mentoring on how to connect to professional associations, become socially integrated, serve as role models, serve on committees, and supervise research assistants.\nThe administrators provided a small number of open-ended responses to this question, but those who did commented only on the role mentoring plays in helping both faculty members and departments to succeed.\n2.4.4 Administrators’ perception of unique mentoring needs  Administrators were asked whether women and faculty of color have special mentoring needs.\nTable 13 : Administrator perceptions of unique mentoring needs for populations  ____________________________________________________________     For women  For faculty of color   Frequency  Percent  Frequency  Percent  Yes  43  68.3  24  44.4  No  20 \f 31.7  30  55.6  Total  63  100.0  54  100.0  ____________________________________________________________  A greater percentage of respondents said women faculty have unique mentoring needs (68%) than faculty of color have unique mentoring needs (44%).\nTable 14 : Observed benefits from mentoring, as per administrators ( N = 78)  Perceptions of benefits observed for junior faculty from mentoring ____________________________________________________________     Frequency  Percent  Achievement of promotion and tenure  49  62.8  Redirection of career path  22  28.2  Successful retention of faculty  36  46.2  Enhanced career satisfaction  42  53.8  Improved teaching  37  47.4  Other  12  15.4  \f         Benefits for senior faculty from mentoring     Frequency  Percent  Enhanced career satisfaction  41  52.6  Improved teaching  8  10.3  Mentoring rewarded in faculty review  20  25.6  Other  9  11.5           Unit benefits from mentoring           Frequency  Percent  Enhanced recruitment efforts  25  \f32.1  Improved collaboration with other units  21  26.9  Other  0  0  ____________________________________________________________  While a multitude possible benefits were identified, for most administrators, benefits for junior faculty were their improved chances for promotion, while benefits for senior faculty were increased career satisfaction.\nTable 15 : Perceived barriers to mentoring  ____________________________________________________________     Barriers \f    Junior Faculty  (n=190)     Administrators  (n=78)  Lack of faculty time  57.9  56.4  Lack of interest/impetus for senior faculty  33.7  26.9  Lack of resources for training  32.1  15.4  Difficulty matching – expertise  26.3  14.1  Difficulty matching – availability  24.7  20.5  Institutional organization does not facilitate mentoring  22.6  5.1  Insufficient trust among faculty  16.8  7.7  Difficulty matching – personalities  14.7  15.4 \f Lack of female role models  13.7  11.5  Lack of minority role models  13.7  20.5  Insufficient numbers of cross-department faculty members  13.2  10.3  Culture discourages mentoring  11.6  3.8  Lack of interest/impetus for junior faculty  11.1  24.4  Other  8.4  6.4  No barriers exist  0  5.1  ____________________________________________________________ Note: Items were “check all that apply”  Junior faculty and administrators concur that time is a significant barrier to mentoring, but they disagree on the importance of organizational structure and resources.\nHigh percentages of both junior faculty (58%) and administrators (56%) identified a lack of faculty time as the most formidable barrier to mentoring.\nWhereas 23% of junior faculty identified institutional organization as a barrier to mentoring, only 5% of administrators selected this item as a barrier.\nSimilarly, 32% of junior faculty cited insufficient resources as an impediment to mentoring as compared to 15% of the administrators."
  },
  {
   "name": "Top Ten Things New Faculty Members .pdf",
   "summaries": "Top Ten Things New Faculty Members Would like to Hear from Colleagues Mary Deane Sorcinelli - University of Massachusetts When we seasoned faculty look back at the early years of our careers in academia, what advice do we wish we had received as we started out?\nMore than a decade of research has identified three core, consistent and interwoven concerns that affect early career faculty as they navigate their way through the first years.\nNew faculty want:  a more comprehensible tenure system a stronger sense of community, and a balanced and integrated life Studies also show that senior colleagues and department chairs can play an important role in creating the kind of academic environment that supports the success of early career faculty (Rice, Sorcinelli & Austin, 2000; Sorcinelli, 2000).\nAs an antidote to the triple threat of evaluation, isolation, and overwork, I'd like to offer some advice drawn not only from research on what helps new faculty succeed, but also from my interactions with hundreds of new and early career faculty members, their mentors, and their chairs.\nThe following are the top ten things I believe new faculty members would most like to hear from their chair (or senior colleagues) as they try to figure out how to live an academic life-that is, how to teach well, produce fruitful research, earn tenure, pay attention to a partner and children, lead an examined life, and make plans for the future  Getting Started 1.\nNewcomers, with new energy and ideas, help us improve our department.\nDespite your greatness, however, you aren't expected to figure out everything about this department and institution on your own.\nI'm sure there are one or two new faculty members who may appear to manage it all in their first year, but in my experience, such an expectation is unrealistic.\nFigure out what matters Every department and college differs in its expectations for research, teaching and service.\nTalk to your department chair and to the dean, but remember that what we say may be constrained by pressures bearing on us at the moment.\nTalk to recently tenured faculty and talk to that respected, older, straight shooting professor who can give you solid, realistic advice.\nBetter yet, along the way, try to sit on the department personnel committee so that you can measure the official version of how things happen against what happens in practice.\nFinally, make an appointment to meet with the department chair at least once a year to review those manageable goals we walked about earlier as well as your teaching and research, your annual faculty report, and the tenure timetable.\nBut you're not going to help your career development if you are working hard on something that does not matter.\nFor example, we all want and need you to be a good department and campus citizen.\nSomeone might relish your chairing the department space or website committee, but let's talk about how you can make the best investments in terms of citizenship in your early years.\nBut teaching, especially a commitment to undergraduate students, increasingly matters a lot in most departments.\nWe know that early career faculty find great satisfaction in being valued as a teacher and advisor by students.\nWe, your senior colleagues, are here to help you figure out where your teaching is going and why you are taking it there.\nSomeone in the teaching and learning center or your dean or your department chair can introduce you to teachers in and outside of our department who are committed to teaching and student learning.\nPut simply, departments can't afford faculty who can't teach their way out of a paper bag.\nWe'll be talking about and assessing teaching and student learning all along the way with you.\nCultivate a specialty that you enjoy and do well (e.g., large classes, junior year writing) as it will make your teaching more coherent and enjoyable.\nHow are you helping to define and complement the department's avowed teaching and research mission?\nHow will your work help to enhance the department?\nFinally, try not to avoid or procrastinate on the important tasks in your plan-on the things that matter.\nI'll introduce you to one or two senior faculty members in the department who have volunteered to meet with you on an ongoing basis.\nMentors inside the department can help you with issues of teaching and scholarship and also on how to read the culture-who's who, what visions people have.\nAgain, I also encourage you to reach out to colleagues beyond the department.\nIf you share a sense of excitement about your teaching and scholarship, it will bring colleagues to you who can contribute to your work.\nThis is a place where we meet to share works in progress, to talk about our teaching and our students, and to socialize.\nReach outside of the department as well-for example, once again, to our teaching and learning center, our scholarly writing group for junior faculty, or our community-service learning initiatives.\nThe good news is that as a new faculty member, you'll probably get better at juggling multiple roles and tasks.\nSomething I did in my early career was to pick one thing that mattered out of all the responsibilities and tasks I'd outlined.\nOnce that one thing went \"out the door,\" be it developing a new course or writing a book chapter, I turned to the next thing that mattered, so there was always one project getting a good chunk of my time.\nIt didn't always work, but it was helpful to hold as an ideal plan.\nIf you are drained, you can't be imaginative in the ways your teaching and research require.\nThere is no doubt from studies of new faculty that despite our best personal efforts, systemic problems remain that prevent faculty, departments, and institutions from being the best that they can be, especially in the pursuit of excellence in teaching and student learning.\nWhat is meaningful faculty work to you?"
  }
 ]
}